vlan 10
name ICE
exit
vlan 20
name CSE
exit
vlan 30
name EECE
exit
vlan 40
name EEE
exit

interface fastEthernet 0/1
switchport access vlan 20
exit
interface fastEthernet 0/2
switchport access vlan 30
exit
interface fastEthernet 0/3
switchport access vlan 40
exit
interface fastEthernet 0/4
switchport mode trunk

interface fastEthernet 0/5     #jodi dui pashe switch thke jemn majher duitar khetre dui pashe switch ache
switchport mode trunk


interface range fastEthernet 0/1-3
switchport mode access
exit



############ CLI
Switch>
Switch>
Switch>
Switch>
Switch>emd
Translating "emd"...domain server (255.255.255.255)
% Unknown command or computer name, or unable to find computer address

Switch>en
Switch#conf
Switch#configure term
Switch#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 10
Switch(config-vlan)#
Switch(config-vlan)#name ICE
Switch(config-vlan)#
Switch(config-vlan)#exit
Switch(config)#
Switch(config)#vlan 20
Switch(config-vlan)#
Switch(config-vlan)#name CSE
Switch(config-vlan)#
Switch(config-vlan)#exit
Switch(config)#
Switch(config)#vlan 30
Switch(config-vlan)#
Switch(config-vlan)#name EECE
Switch(config-vlan)#
Switch(config-vlan)#exit
Switch(config)#
Switch(config)#vlan 40
Switch(config-vlan)#
Switch(config-vlan)#name EEE
Switch(config-vlan)#
Switch(config-vlan)#exit
Switch(config)#
Switch(config)#interfa
Switch(config)#interface e
Switch(config)#interface fa
Switch(config)#interface fastEthernet 0/0
%Invalid interface type and number
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#sw
Switch(config-if)#switchport acc
Switch(config-if)#switchport access vla
Switch(config-if)#switchport access vlan 10
Switch(config-if)#exit
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#
Switch(config-if)#switchport access vlan 10
Switch(config-if)#
Switch(config-if)#exit
Switch(config)#
Switch(config)#interface fastEthernet 0/2
Switch(config-if)#
Switch(config-if)#switchport access vlan 20
Switch(config-if)#
Switch(config-if)#exit
Switch(config)#
Switch(config)#interface fastEthernet 0/3
Switch(config-if)#
Switch(config-if)#switchport access vlan 30
Switch(config-if)#
Switch(config-if)#exit
Switch(config)#
Switch(config)#interface fastEthernet 0/4
Switch(config-if)#
Switch(config-if)#switchport mode trunk

Switch(config-if)#
Switch(config-if)#exit
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/4, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/4, changed state to up
wr
                      ^
% Invalid input detected at '^' marker.
	
Switch(config-if)#exit
Switch(config)#sh
Switch(config)#exit
Switch#
%SYS-5-CONFIG_I: Configured from console by console
wr
Building configuration...
[OK]
Switch#show vl
Switch#show vlan br
Switch#show vlan brief 

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
                                                Gig0/1, Gig0/2
10   ICE                              active    Fa0/1
20   CSE                              active    Fa0/2
30   EECE                             active    Fa0/3
40   EEE                              active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
Switch#conf
Switch#configure t
Switch#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface range fastEthernet 0/1-3
Switch(config-if-range)#
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#exit
Switch(config)#exit
Switch#
%SYS-5-CONFIG_I: Configured from console by console
wr
Building configuration...
[OK]
Switch#








Switch con0 is now available






Press RETURN to get started.

